<?php

$color = ["red"=>"赤","blue"=>"青","green"=>"緑"];

var_dump($color); 
echo '<br>';


$colors =["red"=>"赤","blue"=>"青","green"=>"緑"];
$colors ["yellow"] = "黄色";

var_dump($colors);
echo '<br>';
echo '<br>';
echo '<br>';




echo "1.プルリクエスト"."<br>";
echo "※コードの変更をレビュワーに通知し、マージを依頼する機能です。
       コードのレビューを受け取ることで、
       一人で作ると気が付かないコードの指摘やバグや記述ミスの発見ができコードの品質を高めます。"."<br>"."<br>";
echo "2.Git Flow"."<br>";
echo "※Git Flowは、チームでGitを使う際に役立つ、運用ルールをまとめたツールになります。
       Gitは分散型バージョン管理システムで、
       複数名でプロジェクト・ファイルを共有できる特徴がある。
       開発スピードの向上やミスの低減などメリットがある一方で、
       開発スタート時に運用ルールを定めておかないと、プロジェクトがまとまらないというデメリットがある。"."<br>"."<br>";
echo "3.cron"."<br>";
echo "※UNIX系のOSに入っているプログラムの一つ。
       指示した時間に指定したプログラムを動かしてくれるやつ。"."<br>"."<br>";

?>
